tap 'homebrew/bundle'
tap 'ravenac95/sudolikeaboss'
tap 'caskroom/cask'
tap 'buo/cask-upgrade'

# Install GNU core utilities (those that come with OS X are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'

# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'ack'
brew 'lynx'
brew 'p7zip'
brew 'pv'
brew 'rename'
brew 'tree'
brew 'git'
brew 'python'
brew 'python3'

# Libraries
brew 'cmake'
brew 'grc'
brew 'jp2a'
brew 'openssl'
brew 'readline'
brew 'fzf'
brew 'fzy'
brew 'xz'
brew 'zlib'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'ripgrep'

# Shell stuff
brew 'zsh'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'sudolikeaboss'

# Development
brew 'watchman'

# Cask apps
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'authy'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'scroll-reverser'
cask 'slack'
cask 'spectacle'
