tap 'homebrew/bundle'
tap 'jhawthorn/fzh'

# Install GNU core utilities (those that come with OS X are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'

# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some OS X tools.
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'
brew 'ack'
brew 'lynx'
brew 'p7zip'
brew 'pv'
brew 'rename'
brew 'tree'
brew 'git'
brew 'python'
brew 'python3'

# Libraries
brew 'cmake'
brew 'grc'
brew 'jp2a'
brew 'openssl'
brew 'readline'
brew 'fzf'
brew 'fzy'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'ripgrep'

# Shell stuff
brew 'fish'
brew 'tmux'
brew 'reattach-to-user-namespace'

# Development
brew 'watchman'
